In [0]:
print("Data Bricks")

Data Bricks

In [0]:
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName("SparkCreateTableExample").getOrCreate()

In [0]:
# creating a database
spark.sql("CREATE DATABASE IF NOT EXISTS db;")

Out[2]: DataFrame[]

In [0]:
# creating a table Employee2
spark.sql("CREATE TABLE IF NOT EXISTS Employee2(emp_id Int, emp_name String,Salary INT,age INT,city String)")

Out[6]: DataFrame[]

In [0]:

spark.sql("INSERT INTO Employee2 VALUES (1,'Sona',80000,22,'Hyderabad')")
spark.sql("insert into employee2 values(2,'Sunny',70000,23,'Pune'),(3,'Mona',90000,19,'Hyderabad'),(7,'Chinnu',45000,25,'Mumbai'),(10,'Bannu',12,27,'Pune'),(6,'Raju',70000,45,'Mumbai'),(18,'Dhana',89999,34,'Kolkata')")

Out[7]: DataFrame[num_affected_rows: bigint, num_inserted_rows: bigint]

In [0]:
spark.sql(" select * from employee2").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     2|   Sunny| 70000| 23|     Pune|
|     3|    Mona| 90000| 19|Hyderabad|
|     7|  Chinnu| 45000| 25|   Mumbai|
|    10|   Bannu|    12| 27|     Pune|
|     6|    Raju| 70000| 45|   Mumbai|
|    18|   Dhana| 89999| 34|  Kolkata|
|     1|    Sona| 80000| 22|Hyderabad|
+------+--------+------+---+---------+

In [0]:
# select required columns
spark.sql("select emp_id,emp_name from employee2").show()

+------+--------+
|emp_id|emp_name|
+------+--------+
|     2|   Sunny|
|     3|    Mona|
|     7|  Chinnu|
|    10|   Bannu|
|     6|    Raju|
|    18|   Dhana|
|     1|    Sona|
+------+--------+

In [0]:
# filter using where clause
spark.sql(" select emp_id,emp_name from employee2 where city='Pune' ").show()

+------+--------+
|emp_id|emp_name|
+------+--------+
|     2|   Sunny|
|    10|   Bannu|
+------+--------+

In [0]:
spark.sql("select * from employee2 where city='Pune' and emp_id=10 ").show()

+------+--------+------+---+----+
|emp_id|emp_name|Salary|age|city|
+------+--------+------+---+----+
|    10|   Bannu|    12| 27|Pune|
+------+--------+------+---+----+

In [0]:
# group by
spark.sql("select city,count(*) as city_count from employee2 group by city").show()

+---------+----------+
|     city|city_count|
+---------+----------+
|   Mumbai|         2|
|  Kolkata|         1|
|     Pune|         2|
|Hyderabad|         2|
+---------+----------+

In [0]:
# aggregations
# 1) sum()
spark.sql("select sum(salary) as Salary_sum,city from employee2 group by city").show()

# 2) min()
spark.sql("select min(salary) as Salary_Min,city from employee2 group by city").show()

# 3) max()
spark.sql("select max(salary) as Salary_Max,city from employee2 group by city").show()

# 4) avg()
spark.sql("select avg(salary) as Salary_Avg,city from employee2 group by city").show()

# 5) mean()
spark.sql("select mean(salary) as Salary_mean,city from employee2 group by city ").show()

# 6) count()
spark.sql("select count(*) as Count_emp from employee2").show()

+----------+---------+
|Salary_sum|     city|
+----------+---------+
|    115000|   Mumbai|
|     89999|  Kolkata|
|     70012|     Pune|
|    170000|Hyderabad|
+----------+---------+

+----------+---------+
|Salary_Min|     city|
+----------+---------+
|     45000|   Mumbai|
|     89999|  Kolkata|
|        12|     Pune|
|     80000|Hyderabad|
+----------+---------+

+----------+---------+
|Salary_Max|     city|
+----------+---------+
|     70000|   Mumbai|
|     89999|  Kolkata|
|     70000|     Pune|
|     90000|Hyderabad|
+----------+---------+

+----------+---------+
|Salary_Avg|     city|
+----------+---------+
|   57500.0|   Mumbai|
|   89999.0|  Kolkata|
|   35006.0|     Pune|
|   85000.0|Hyderabad|
+----------+---------+

+-----------+---------+
|Salary_mean|     city|
+-----------+---------+
|    57500.0|   Mumbai|
|    89999.0|  Kolkata|
|    35006.0|     Pune|
|    85000.0|Hyderabad|
+-----------+---------+

+---------+
|Count_emp|
+---------+
|        7|
+---------+

In [0]:
# order by
spark.sql("select * from employee2 order by city,emp_id").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     1|    Sona| 80000| 22|Hyderabad|
|     3|    Mona| 90000| 19|Hyderabad|
|    18|   Dhana| 89999| 34|  Kolkata|
|     6|    Raju| 70000| 45|   Mumbai|
|     7|  Chinnu| 45000| 25|   Mumbai|
|     2|   Sunny| 70000| 23|     Pune|
|    10|   Bannu|    12| 27|     Pune|
+------+--------+------+---+---------+

In [0]:
# in descending order
spark.sql("select * from employee2 order by emp_name desc").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     2|   Sunny| 70000| 23|     Pune|
|     1|    Sona| 80000| 22|Hyderabad|
|     6|    Raju| 70000| 45|   Mumbai|
|     3|    Mona| 90000| 19|Hyderabad|
|    18|   Dhana| 89999| 34|  Kolkata|
|     7|  Chinnu| 45000| 25|   Mumbai|
|    10|   Bannu|    12| 27|     Pune|
+------+--------+------+---+---------+

In [0]:
# Joins
# create another table department
spark.sql("create table if not exists Department(dept_id int,emp_id int,dept_name string)")

# insert records into department table
spark.sql("insert into Department values(100,1,'IT'),(102,6,'HR'),(103,13,'Manager'),(109,7,'Developer'),(110,10,'Tester')")

Out[17]: DataFrame[num_affected_rows: bigint, num_inserted_rows: bigint]

In [0]:
# records of department table
spark.sql("select * from department").show()

+-------+------+---------+
|dept_id|emp_id|dept_name|
+-------+------+---------+
|    100|     1|       IT|
|    102|     6|       HR|
|    103|    13|  Manager|
|    109|     7|Developer|
|    110|    10|   Tester|
+-------+------+---------+

In [0]:
# Left join
spark.sql("select * from employee2 left join department on employee2.emp_id=department.emp_id").show()

spark.sql("select * from employee2 left outer join department on employee2.emp_id=department.emp_id").show()

+------+--------+------+---+---------+-------+------+---------+
|emp_id|emp_name|Salary|age|     city|dept_id|emp_id|dept_name|
+------+--------+------+---+---------+-------+------+---------+
|     2|   Sunny| 70000| 23|     Pune|   null|  null|     null|
|     3|    Mona| 90000| 19|Hyderabad|   null|  null|     null|
|     7|  Chinnu| 45000| 25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12| 27|     Pune|    110|    10|   Tester|
|     6|    Raju| 70000| 45|   Mumbai|    102|     6|       HR|
|    18|   Dhana| 89999| 34|  Kolkata|   null|  null|     null|
|     1|    Sona| 80000| 22|Hyderabad|    100|     1|       IT|
+------+--------+------+---+---------+-------+------+---------+

+------+--------+------+---+---------+-------+------+---------+
|emp_id|emp_name|Salary|age|     city|dept_id|emp_id|dept_name|
+------+--------+------+---+---------+-------+------+---------+
|     2|   Sunny| 70000| 23|     Pune|   null|  null|     null|
|     3|    Mona| 90000| 19|Hyderabad|   null|  null|     null|
|     7|  Chinnu| 45000| 25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12| 27|     Pune|    110|    10|   Tester|
|     6|    Raju| 70000| 45|   Mumbai|    102|     6|       HR|
|    18|   Dhana| 89999| 34|  Kolkata|   null|  null|     null|
|     1|    Sona| 80000| 22|Hyderabad|    100|     1|       IT|
+------+--------+------+---+---------+-------+------+---------+

In [0]:
# Right join
spark.sql("select * from employee2 right join department on employee2.emp_id=department.emp_id").show()

spark.sql("select * from employee2 right outer join  department on employee2.emp_id=department.emp_id").show()

+------+--------+------+----+---------+-------+------+---------+
|emp_id|emp_name|Salary| age|     city|dept_id|emp_id|dept_name|
+------+--------+------+----+---------+-------+------+---------+
|     1|    Sona| 80000|  22|Hyderabad|    100|     1|       IT|
|     6|    Raju| 70000|  45|   Mumbai|    102|     6|       HR|
|  null|    null|  null|null|     null|    103|    13|  Manager|
|     7|  Chinnu| 45000|  25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12|  27|     Pune|    110|    10|   Tester|
+------+--------+------+----+---------+-------+------+---------+

+------+--------+------+----+---------+-------+------+---------+
|emp_id|emp_name|Salary| age|     city|dept_id|emp_id|dept_name|
+------+--------+------+----+---------+-------+------+---------+
|     1|    Sona| 80000|  22|Hyderabad|    100|     1|       IT|
|     6|    Raju| 70000|  45|   Mumbai|    102|     6|       HR|
|  null|    null|  null|null|     null|    103|    13|  Manager|
|     7|  Chinnu| 45000|  25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12|  27|     Pune|    110|    10|   Tester|
+------+--------+------+----+---------+-------+------+---------+

In [0]:
# Inner join
spark.sql("select * from employee2  join  department on employee2.emp_id=department.emp_id").show()

+------+--------+------+---+---------+-------+------+---------+
|emp_id|emp_name|Salary|age|     city|dept_id|emp_id|dept_name|
+------+--------+------+---+---------+-------+------+---------+
|     7|  Chinnu| 45000| 25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12| 27|     Pune|    110|    10|   Tester|
|     6|    Raju| 70000| 45|   Mumbai|    102|     6|       HR|
|     1|    Sona| 80000| 22|Hyderabad|    100|     1|       IT|
+------+--------+------+---+---------+-------+------+---------+

In [0]:
# Full outer join
spark.sql("select * from employee2  full outer join  department on employee2.emp_id=department.emp_id").show()

spark.sql("select * from employee2  full join  department on employee2.emp_id=department.emp_id").show()

+------+--------+------+----+---------+-------+------+---------+
|emp_id|emp_name|Salary| age|     city|dept_id|emp_id|dept_name|
+------+--------+------+----+---------+-------+------+---------+
|     1|    Sona| 80000|  22|Hyderabad|    100|     1|       IT|
|     2|   Sunny| 70000|  23|     Pune|   null|  null|     null|
|     3|    Mona| 90000|  19|Hyderabad|   null|  null|     null|
|     6|    Raju| 70000|  45|   Mumbai|    102|     6|       HR|
|     7|  Chinnu| 45000|  25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12|  27|     Pune|    110|    10|   Tester|
|  null|    null|  null|null|     null|    103|    13|  Manager|
|    18|   Dhana| 89999|  34|  Kolkata|   null|  null|     null|
+------+--------+------+----+---------+-------+------+---------+

+------+--------+------+----+---------+-------+------+---------+
|emp_id|emp_name|Salary| age|     city|dept_id|emp_id|dept_name|
+------+--------+------+----+---------+-------+------+---------+
|     1|    Sona| 80000|  22|Hyderabad|    100|     1|       IT|
|     2|   Sunny| 70000|  23|     Pune|   null|  null|     null|
|     3|    Mona| 90000|  19|Hyderabad|   null|  null|     null|
|     6|    Raju| 70000|  45|   Mumbai|    102|     6|       HR|
|     7|  Chinnu| 45000|  25|   Mumbai|    109|     7|Developer|
|    10|   Bannu|    12|  27|     Pune|    110|    10|   Tester|
|  null|    null|  null|null|     null|    103|    13|  Manager|
|    18|   Dhana| 89999|  34|  Kolkata|   null|  null|     null|
+------+--------+------+----+---------+-------+------+---------+

In [0]:
# Left semi join
spark.sql("select * from employee2  left semi join  department on employee2.emp_id=department.emp_id").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     7|  Chinnu| 45000| 25|   Mumbai|
|    10|   Bannu|    12| 27|     Pune|
|     6|    Raju| 70000| 45|   Mumbai|
|     1|    Sona| 80000| 22|Hyderabad|
+------+--------+------+---+---------+

In [0]:
# left anti
spark.sql("select * from employee2  left anti join  department on employee2.emp_id=department.emp_id").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     2|   Sunny| 70000| 23|     Pune|
|     3|    Mona| 90000| 19|Hyderabad|
|    18|   Dhana| 89999| 34|  Kolkata|
+------+--------+------+---+---------+

In [0]:
# Creating a temporary view

# Creating Employee2  DataFrame containing the data of employees
Employee2 = spark.sql("SELECT * FROM Employee2")
print(type(Employee2))

# Create a temporary view from the DataFrame
Employee2.createOrReplaceTempView("employee2_view")

# Example query using the temporary view
spark.sql("SELECT * FROM employee2_view").show()

<class 'pyspark.sql.dataframe.DataFrame'>
+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     2|   Sunny| 70000| 23|     Pune|
|     3|    Mona| 90000| 19|Hyderabad|
|     7|  Chinnu| 45000| 25|   Mumbai|
|    10|   Bannu|    12| 27|     Pune|
|     6|    Raju| 70000| 45|   Mumbai|
|    18|   Dhana| 89999| 34|  Kolkata|
|     1|    Sona| 80000| 22|Hyderabad|
+------+--------+------+---+---------+

In [0]:
# selecting required columns from temporary view
spark.sql("select emp_id,emp_name from employee2_view").show()

+------+--------+
|emp_id|emp_name|
+------+--------+
|     2|   Sunny|
|     3|    Mona|
|     7|  Chinnu|
|    10|   Bannu|
|     6|    Raju|
|    18|   Dhana|
|     1|    Sona|
+------+--------+

In [0]:
# applying condition on temporary view that is created

spark.sql(" select emp_name,Salary,age from employee2_view where emp_id=3").show()

+--------+------+---+
|emp_name|Salary|age|
+--------+------+---+
|    Mona| 90000| 19|
+--------+------+---+

In [0]:
spark.sql("select * from employee2_view where emp_name like '%on%' ").show()

+------+--------+------+---+---------+
|emp_id|emp_name|Salary|age|     city|
+------+--------+------+---+---------+
|     3|    Mona| 90000| 19|Hyderabad|
|     1|    Sona| 80000| 22|Hyderabad|
+------+--------+------+---+---------+

In [0]:
# Window functions
# i) ROW_NUMBER()
# with partition

spark.sql("""
    SELECT emp_id, emp_name,
           ROW_NUMBER() OVER(PARTITION BY city ORDER BY salary) AS rn 
    FROM employee2_view
""").show()

+------+--------+---+
|emp_id|emp_name| rn|
+------+--------+---+
|     1|    Sona|  1|
|     3|    Mona|  2|
|    18|   Dhana|  1|
|     7|  Chinnu|  1|
|     6|    Raju|  2|
|    10|   Bannu|  1|
|     2|   Sunny|  2|
+------+--------+---+

In [0]:
# without partition

spark.sql("""
    SELECT emp_id, emp_name,
           ROW_NUMBER() OVER(ORDER BY salary) AS rn 
    FROM employee2_view
""").show()

+------+--------+---+
|emp_id|emp_name| rn|
+------+--------+---+
|    10|   Bannu|  1|
|     7|  Chinnu|  2|
|     2|   Sunny|  3|
|     6|    Raju|  4|
|     1|    Sona|  5|
|    18|   Dhana|  6|
|     3|    Mona|  7|
+------+--------+---+

In [0]:

# ii) RANK()
# with partition

spark.sql("""
    SELECT emp_id, emp_name,
           RANK() OVER(PARTITION BY city ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|     1|    Sona|   1|
|     3|    Mona|   2|
|    18|   Dhana|   1|
|     7|  Chinnu|   1|
|     6|    Raju|   2|
|    10|   Bannu|   1|
|     2|   Sunny|   2|
+------+--------+----+

In [0]:

# without partition

spark.sql("""
    SELECT emp_id, emp_name,
           RANK() OVER( ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|    10|   Bannu|   1|
|     7|  Chinnu|   2|
|     2|   Sunny|   3|
|     6|    Raju|   3|
|     1|    Sona|   5|
|    18|   Dhana|   6|
|     3|    Mona|   7|
+------+--------+----+

In [0]:

# iii) DENSE_RANK()
# with partition

spark.sql("""
    SELECT emp_id, emp_name,
           DENSE_RANK() OVER(PARTITION BY city ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|     1|    Sona|   1|
|     3|    Mona|   2|
|    18|   Dhana|   1|
|     7|  Chinnu|   1|
|     6|    Raju|   2|
|    10|   Bannu|   1|
|     2|   Sunny|   2|
+------+--------+----+

In [0]:

# iii) DENSE_RANK()
# without partition

spark.sql("""
    SELECT emp_id, emp_name,
           DENSE_RANK() OVER(ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|    10|   Bannu|   1|
|     7|  Chinnu|   2|
|     2|   Sunny|   3|
|     6|    Raju|   3|
|     1|    Sona|   4|
|    18|   Dhana|   5|
|     3|    Mona|   6|
+------+--------+----+

In [0]:

# iv) NTILE(N)
# with partition

spark.sql("""
    SELECT emp_id, emp_name,
           ntile(2) OVER(PARTITION BY city ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|     1|    Sona|   1|
|     3|    Mona|   2|
|    18|   Dhana|   1|
|     7|  Chinnu|   1|
|     6|    Raju|   2|
|    10|   Bannu|   1|
|     2|   Sunny|   2|
+------+--------+----+

In [0]:

# iv) NTILE(N)
# without partition

spark.sql("""
    SELECT emp_id, emp_name,
           ntile(2) OVER( ORDER BY salary) AS rank 
    FROM employee2_view
""").show()

+------+--------+----+
|emp_id|emp_name|rank|
+------+--------+----+
|    10|   Bannu|   1|
|     7|  Chinnu|   1|
|     2|   Sunny|   1|
|     6|    Raju|   1|
|     1|    Sona|   2|
|    18|   Dhana|   2|
|     3|    Mona|   2|
+------+--------+----+

In [0]:
# Aggregate functions in Window Functions
spark.sql(""" SELECT emp_id,emp_name,
 MAX(salary) over(partition by city) as max_salary,
 MIN(salary) over(partition by city) as min_salary,
 AVG(salary) over(partition by city) as avg_salary,
 SUM(salary) over(PARTITION BY city) as sum_salary
 FROM employee2_view""").show()

+------+--------+----------+----------+----------+----------+
|emp_id|emp_name|max_salary|min_salary|avg_salary|sum_salary|
+------+--------+----------+----------+----------+----------+
|     3|    Mona|     90000|     80000|   85000.0|    170000|
|     1|    Sona|     90000|     80000|   85000.0|    170000|
|    18|   Dhana|     89999|     89999|   89999.0|     89999|
|     7|  Chinnu|     70000|     45000|   57500.0|    115000|
|     6|    Raju|     70000|     45000|   57500.0|    115000|
|     2|   Sunny|     70000|        12|   35006.0|     70012|
|    10|   Bannu|     70000|        12|   35006.0|     70012|
+------+--------+----------+----------+----------+----------+